// Задача 19 Напишите программу, 
// принимает на вход пятизначное число
// проверяет, является ли оно палиндромом.
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).

Console.Write("Введите пятизначное число: ");
int fiveDigit = Convert.ToInt32(Console.ReadLine());


